{
  "0": "<PAD>",
  "1": "<UNK>",
  "6677": "<NUM> <NUM> <NUM> INFO dfs.DataNode$DataXceiver: Receiving block <BLK> src: /<IP> dest: /<IP>",
  "5413": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO generating core.<NUM>",
  "6686": "<NUM> <NUM> <NUM> INFO dfs.DataNode$PacketResponder: PacketResponder <NUM> for block <BLK> terminating",
  "6694": "<NUM> <NUM> <NUM> INFO dfs.FSNamesystem: BLOCK* NameSystem.addStoredBlock: blockMap updated: <IP> is added to <BLK> size <HEX>",
  "6687": "<NUM> <NUM> <NUM> INFO dfs.DataNode$PacketResponder: Received block <BLK> of size <HEX> from /<IP>",
  "6691": "<NUM> <NUM> <NUM> INFO dfs.FSDataset: Deleting block <BLK> file <PATH><BLK>",
  "6697": "<NUM> <NUM> <NUM> INFO dfs.FSNamesystem: BLOCK* NameSystem.delete: <BLK> is added to invalidSet of <IP>",
  "6696": "<NUM> <NUM> <NUM> INFO dfs.FSNamesystem: BLOCK* NameSystem.allocateBlock: <PATH> <BLK>",
  "5414": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO iar <HEX> dear <HEX>",
  "6674": "<NUM> <NUM> <NUM> INFO dfs.DataNode$DataXceiver: <IP> Served block <BLK> to /<IP>",
  "6703": "<NUM> <NUM> <NUM> WARN dfs.DataNode$DataXceiver: <IP>:Got exception while serving <BLK> to /<IP>:",
  "1731": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> floating point alignment exceptions",
  "1730": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> double-hummer alignment exceptions",
  "6724": "KERNDTLB <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL data TLB error interrupt",
  "1759": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> total interrupts. <NUM> critical input interrupts. <NUM> microseconds total spent on critical input interrupts, <NUM> microseconds max time in a critical input interrupt.",
  "1732": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> microseconds spent in the rbs signal handler during <NUM> calls. <NUM> microseconds was the maximum time for a single instance of a correctable ddr.",
  "6666": "<NUM> <NUM> <NUM> INFO dfs.DataBlockScanner: Verification succeeded for <BLK>",
  "1715": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <HEX> double-hummer alignment exceptions",
  "5417": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO instruction cache parity error corrected",
  "5440": "- <HEX> <DATE> NULL <TS> NULL RAS MMCS ERROR idoproxydb hit ASSERT condition: ASSERT expression=<NUM> Source file=idotransportmgr.cpp Source line=<NUM> Function=int IdoTransportMgr::SendPacket(IdoUdpMgr*, BglCtlPavTrace*)",
  "7821": "KERNSTOR <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL data storage interrupt",
  "6695": "<NUM> <NUM> <NUM> INFO dfs.FSNamesystem: BLOCK* NameSystem.addStoredBlock: blockMap updated: <IP> is added to <BLK> size <NUM>",
  "6688": "<NUM> <NUM> <NUM> INFO dfs.DataNode$PacketResponder: Received block <BLK> of size <NUM> from /<IP>",
  "5360": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: generated <NUM> core files for program <PATH>",
  "1548": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL instruction address: 0x00004ed8",
  "1344": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH>: invalid or missing program image, No such file or directory",
  "1345": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH>: invalid or missing program image, Permission denied",
  "1729": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> ddr errors(s) detected and corrected on rank <NUM>, symbol <NUM>, bit <NUM>",
  "1712": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO",
  "5433": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO total of <NUM> ddr error(s) detected and corrected",
  "1358": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: LOGIN chdir(<PATH>) failed: No such file or directory",
  "6720": "APPSEV <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error reading message prefix on CioStream socket to <IP>, Link has been severed",
  "1342": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH>: invalid or missing program image, Exec format error",
  "7829": "KERNTERM <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts: kernel terminated for reason <NUM>",
  "1371": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL <NUM>:<HEX> <NUM>:<HEX> <NUM>:<HEX> <NUM>:<HEX>",
  "5315": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001f2",
  "1109": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY WARNING Node card is not fully functional",
  "6716": "APPSEV <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error reading message prefix after LOAD_MESSAGE on CioStream socket to <IP>: Link has been severed",
  "1027": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY SEVERE Can not get assembly information for node card",
  "1587": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL machine check: i-fetch......................<NUM>",
  "1423": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL data address: 0x00000002",
  "1454": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL exception syndrome register: 0x00800000",
  "5157": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO MACHINE CHECK DCR read timeout (mc=e08x iar 0x00000000 lr 0xc00045a4)",
  "1466": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL floating pt ex mode <NUM> enable......<NUM>",
  "5397": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO data cache search parity error detected. attempting to correct",
  "25": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Node card status: no ALERTs are active. Clock Mode is Low. Clock Select is Midplane. Phy JTAG Reset is asserted. ASIC JTAG Reset is asserted. Temperature Mask is not active. No temperature error. Temperature Limit Error Latch is clear. PGOOD IS NOT ASSERTED. PGOOD ERROR LATCH IS ACTIVE. MPGOOD IS NOT OK. MPGOOD ERROR LATCH IS ACTIVE. The <NUM>.<NUM> volt rail is OK. The <NUM>.<NUM> volt rail is OK.",
  "1360": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: LOGIN chdir(<PATH><DATE>-<NUM>.<NUM>.<NUM>) failed: No such file or directory",
  "1716": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <HEX> floating point alignment exceptions",
  "1728": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> ddr error(s) detected and corrected on rank <NUM>, symbol <NUM> over <NUM> seconds",
  "1634": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: illegal instruction......<NUM>",
  "5434": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO total of <NUM> ddr error(s) detected and corrected over <NUM> seconds",
  "5432": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO suppressing further interrupts of same type",
  "1630": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL problem state (<NUM>=sup,<NUM>=usr).......<NUM>",
  "6689": "<NUM> <NUM> <NUM> INFO dfs.DataNode: <IP> Starting thread to transfer block <BLK> to <IP>",
  "1547": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL instruction address space.........<NUM>",
  "1638": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: unimplemented operation..<NUM>",
  "1402": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL auxiliary processor.........................<NUM>",
  "1464": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL floating point instr. enabled.....<NUM>",
  "6699": "<NUM> <NUM> <NUM> INFO dfs.FSNamesystem: BLOCK* ask <IP> to replicate <BLK> to datanode(s) <IP>",
  "1414": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL core configuration register: 0x00002000",
  "1581": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL machine check enable..............<NUM>",
  "6673": "<NUM> <NUM> <NUM> INFO dfs.DataNode$DataTransfer: <IP>:Transmitted block <BLK> to /<IP>",
  "1437": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL debug wait enable.................<NUM>",
  "1442": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL disable store gathering..................<NUM>",
  "5371": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: pollControlDescriptors: Detected the debugger died.",
  "1632": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: fp cr field .............<NUM>",
  "1710": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL wait state enable.................<NUM>",
  "1436": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL debug interrupt enable............<NUM>",
  "1463": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL external input interrupt enable...<NUM>",
  "1403": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL byte ordering exception.....................<NUM>",
  "7815": "KERNREC <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL Error receiving packet on tree network, expecting type <NUM> instead of type <NUM> (softheader=<HEX> <HEX> <HEX> <HEX>) PSR0=<HEX> PSR1=<HEX> PRXF=<HEX> PIXF=<HEX>",
  "1431": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL data store interrupt caused by dcbf.........<NUM>",
  "1636": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: privileged instruction...<NUM>",
  "6675": "<NUM> <NUM> <NUM> INFO dfs.DataNode$DataXceiver: Received block <BLK> src: /<IP> dest: /<IP> of size <HEX>",
  "5317": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001f5",
  "1422": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL data address space................<NUM>",
  "5307": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001b0",
  "1635": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: imprecise exception......<NUM>",
  "1631": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: fp compare...............<NUM>",
  "1465": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL floating point operation....................<NUM>",
  "1419": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL critical input interrupt enable...<NUM>",
  "1700": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL store operation.............................<NUM>",
  "1432": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL data store interrupt caused by icbi.........<NUM>",
  "1589": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL machine state register: 0x00002000",
  "6713": "APPREAD <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: failed to read message prefix on control stream (CioStream socket to <IP>",
  "1637": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: trap instruction.........<NUM>",
  "6717": "APPSEV <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error reading message prefix after LOGIN_MESSAGE on CioStream socket to <IP>: Link has been severed",
  "6704": "<NUM> <NUM> <NUM> WARN dfs.FSDataset: Unexpected error trying to delete block <BLK>. BlockInfo not found in volumeMap.",
  "1633": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL program interrupt: fp cr update.............<NUM>",
  "1762": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> tree receiver <NUM> in re-synch state event(s) (dcr 0x019a) detected",
  "5439": "- <HEX> <DATE> NULL <TS> NULL RAS MMCS ERROR Ido packet timeout",
  "1724": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> L3 EDRAM error(s) (dcr 0x0157) detected and corrected",
  "5425": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: illegal instruction......<NUM>",
  "5408": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO exception syndrome register: 0x08000000",
  "5427": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: privileged instruction...<NUM>",
  "7816": "KERNRTSP <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts panic! - stopping execution",
  "5421": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt",
  "5431": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO store operation.............................<NUM>",
  "5419": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO machine check: i-fetch......................<NUM>",
  "5399": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO data store interrupt caused by icbi.........<NUM>",
  "5398": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO data store interrupt caused by dcbf.........<NUM>",
  "5428": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: trap instruction.........<NUM>",
  "5154": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO L1 DCACHE summary averages: #ofDirtyLines: <NUM> out of <NUM> #ofDirtyDblWord: <NUM> out of <NUM>",
  "6682": "<NUM> <NUM> <NUM> INFO dfs.DataNode$DataXceiver: writeBlock <BLK> received exception java.io.IOException: Could not read from stream",
  "5410": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO floating point operation....................<NUM>",
  "5355": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: cpu <NUM> at treeaddr <NUM> sent unrecognized message 0xffffffff",
  "1443": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL disable trace broadcast..................<NUM>",
  "5369": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: generated <NUM> core files for program IMB-MPI1.4KB_perf",
  "1543": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL icache prefetch depth....................<NUM>",
  "6659": "- <HEX> <DATE> UNKNOWN_LOCATION <TS> UNKNOWN_LOCATION NULL DISCOVERY WARNING Node card is not fully functional",
  "5319": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001f8",
  "5305": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Message code <NUM> is not <NUM> or <HEX>",
  "1540": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL guaranteed data cache block touch........<NUM>",
  "6719": "APPSEV <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error reading message prefix after VERSION_MESSAGE on CioStream socket to <IP>: Link has been severed",
  "1467": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL force load<PATH> alignment...............<NUM>",
  "5429": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: unimplemented operation..<NUM>",
  "1541": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL guaranteed instruction cache block touch.<NUM>",
  "1544": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL icache prefetch threshold................<NUM>",
  "1735": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver x+ input pipe error(s) (dcr 0x02ec) detected and corrected",
  "6723": "APPUNAV <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error creating node map from file <PATH>: Resource temporarily unavailable",
  "6715": "APPRES <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error reading message prefix on CioStream socket to <IP>, Connection reset by peer",
  "1439": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL disable apu instruction broadcast........<NUM>",
  "1578": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL lr:<HEX> cr:<HEX> xer:<HEX> ctr:<HEX>",
  "6721": "APPTO <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error reading message prefix on CioStream socket to <IP>, Connection timed out",
  "1665": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts internal error",
  "1539": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL general purpose registers:",
  "3621": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x18f71180, mask 0x02",
  "1693": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL special purpose registers:",
  "1362": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: LOGIN chdir(pwd) failed: No such file or directory",
  "5295": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO auxiliary processor.........................<NUM>",
  "5422": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: fp compare...............<NUM>",
  "5296": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO byte ordering exception.....................<NUM>",
  "6600": "- <HEX> <DATE> UNKNOWN_LOCATION <TS> UNKNOWN_LOCATION NULL DISCOVERY SEVERE Can not get assembly information for node card",
  "5485": "- <HEX> <DATE> UNKNOWN_LOCATION <TS> UNKNOWN_LOCATION NULL DISCOVERY ERROR Node card status: no ALERTs are active. Clock Mode is Low. Clock Select is Midplane. Phy JTAG Reset is asserted. ASIC JTAG Reset is asserted. Temperature Mask is not active. No temperature error. Temperature Limit Error Latch is clear. PGOOD IS NOT ASSERTED. PGOOD ERROR LATCH IS ACTIVE. MPGOOD IS NOT OK. MPGOOD ERROR LATCH IS ACTIVE. The <NUM>.<NUM> volt rail is OK. The <NUM>.<NUM> volt rail is OK.",
  "1763": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> tree receiver <NUM> in re-synch state event(s) (dcr 0x019a) detected over <NUM> seconds",
  "1739": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver y+ input pipe error(s) (dcr 0x02ee) detected and corrected",
  "5362": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: generated <NUM> core files for program <PATH><IP>105_opt_cpm_essl",
  "3132": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x11042a80, mask 0x04",
  "5415": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO instruction address: 0x0062fdf4",
  "5424": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: fp cr update.............<NUM>",
  "1745": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver z- input pipe error(s) (dcr 0x02f1) detected and corrected",
  "5426": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: imprecise exception......<NUM>",
  "5423": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO program interrupt: fp cr field .............<NUM>",
  "7824": "KERNTERM <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts: kernel terminated for reason 1001rts: bad message header: invalid cpu, type=<NUM>, cpu=<NUM>, index=<NUM>, total=<NUM>",
  "5420": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO machine state register: 0x0000f000",
  "5306": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Missing or invalid fields on line <NUM> of node map file <PATH>",
  "1327": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error creating node map from file <PATH>: Bad file descriptor",
  "1361": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: LOGIN chdir(RUNS<PATH>) failed: No such file or directory",
  "5416": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO instruction address: 0x0062fe04",
  "5297": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Error opening node map file <PATH>, No such file or directory",
  "2546": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x07a95e80, mask 0x10",
  "7822": "KERNTERM <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts: kernel terminated for reason 1001rts: bad message header: invalid cpu, type=<NUM>, cpu=<NUM>, index=<HEX>, total=<HEX>",
  "1743": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver z+ input pipe error(s) (dcr 0x02f0) detected and corrected",
  "3374": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x145e5be0, mask 0x01",
  "1760": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> tree receiver <NUM> in re-synch state event(s) (dcr 0x0185) detected",
  "6672": "<NUM> <NUM> <NUM> INFO dfs.DataNode$BlockReceiver: Receiving empty packet for block <BLK>",
  "6731": "KERNMICRO <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL Microloader Assertion",
  "1326": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error creating node map from file <PATH>: Bad address",
  "1737": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver x- input pipe error(s) (dcr 0x02ed) detected and corrected",
  "1741": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver y- input pipe error(s) (dcr 0x02ef) detected and corrected",
  "1725": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> L3 EDRAM error(s) (dcr 0x0157) detected and corrected over <NUM> seconds",
  "3746": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b719940, mask 0x02",
  "1329": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error creating node map from file <PATH>: Permission denied",
  "3336": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x13a33060, mask 0x10",
  "2550": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x07d02da0, mask 0x80",
  "3447": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1682ed20, mask 0x01",
  "3891": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1bb2fe80, mask 0x02",
  "1347": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH>: program image too big, <HEX> > <HEX>",
  "5352": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Y coordinate <NUM> exceeds physical dimension <NUM> at line <NUM> of node map file <PATH>",
  "5404": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ddr: activating redundant bit steering: rank=<NUM> symbol=<NUM>",
  "1348": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH><IP>905_opt_essl_cpm: invalid or missing program image, Permission denied",
  "5382": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x0b): warning for torus z- wire",
  "6692": "<NUM> <NUM> <NUM> INFO dfs.FSNamesystem: BLOCK* NameSystem.addStoredBlock: addStoredBlock request received for <BLK> on <IP> size <HEX> But it does not belong to any file.",
  "3294": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x13253280, mask 0x04",
  "3790": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b858280, mask 0x40",
  "1354": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading allreduce_int_V1R1.rts: invalid or missing program image, No such file or directory",
  "5353": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Z coordinate <NUM> exceeds physical dimension <NUM> at line <NUM> of node map file <PATH>",
  "3377": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x146282e0, mask 0x04",
  "1336": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading -mode VN: invalid or missing program image, No such file or directory",
  "7828": "KERNTERM <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts: kernel terminated for reason 1004rts: bad message header: expecting type <NUM>, type=<NUM>, cpu=<NUM>, index=<NUM>, total=<NUM>",
  "1687": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts: bad message header: expecting type <NUM> instead of type <NUM> (softheader=<HEX> <HEX> <HEX> <HEX>) PSR0=<HEX> PSR1=<HEX> PRXF=<HEX> PIXF=<HEX>",
  "2499": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x06d237c0, mask 0x20",
  "1764": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> tree receiver <NUM> in re-synch state event(s) (dcr 0x01bc) detected",
  "1312": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL MONITOR FAILURE Temperature Over Limit on link card",
  "5380": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x0a): warning for torus z+ wire",
  "5347": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: T coordinate <NUM> exceeds physical dimension <NUM> at line <NUM> of node map file <PATH>",
  "1353": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading allreduce_double_V1R1.rts: invalid or missing program image, No such file or directory",
  "5395": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x17): warning for tree C1 wire, suppressing further interrupts of same type",
  "2345": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x057c7e00, mask 0x20",
  "1746": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver z- input pipe error(s) (dcr 0x02f1) detected and corrected over <NUM> seconds",
  "1346": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH>: not a CNK program image",
  "1350": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH><IP>905_vnm_essl_cpm: invalid or missing program image, No such file or directory",
  "2271": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x045ba220, mask 0x02",
  "5376": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x06): warning for torus y+ wire",
  "3637": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x194d95c0, mask 0x08",
  "5436": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS LINKCARD INFO MidplaneSwitchController performing bit sparing on <NODE> bit <NUM>",
  "3252": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x12870760, mask 0x40",
  "3943": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1c9b3960, mask 0x02",
  "2261": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x042358a0, mask 0x20",
  "2160": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0353d340, mask 0x04",
  "3395": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x151a8180, mask 0x02",
  "5368": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: generated <NUM> core files for program IMB-MPI1.2MB_perf",
  "1349": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH><IP>905_opt_essl_vnm: invalid or missing program image, Permission denied",
  "3625": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x18fa5d40, mask 0x80",
  "1328": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error creating node map from file <PATH>: Block device required",
  "3058": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0fa3d060, mask 0x08",
  "1369": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL <NUM>",
  "5339": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x00001a12",
  "3825": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b8594e0, mask 0x40",
  "5381": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x0a): warning for torus z+ wire, suppressing further interrupts of same type",
  "2294": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x049af800, mask 0x02",
  "3810": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b858ec0, mask 0x40",
  "5394": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x17): warning for tree C1 wire",
  "2030": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x01d7eaa0, mask 0x02",
  "6712": "APPOUT <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: LOGIN chdir(<PATH>) failed: Input<PATH> error",
  "5310": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001b4",
  "2025": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x01a60980, mask 0x80",
  "6705": "<NUM> <NUM> <NUM> WARN dfs.FSNamesystem: BLOCK* NameSystem.addStoredBlock: Redundant addStoredBlock request received for <BLK> on <IP> size <HEX>",
  "2386": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x06047860, mask 0x20",
  "3111": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x10b59900, mask 0x02",
  "5374": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x03): warning for torus x- wire",
  "2315": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x04d37340, mask 0x08",
  "1761": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> tree receiver <NUM> in re-synch state event(s) (dcr 0x0185) detected over <NUM> seconds",
  "6676": "<NUM> <NUM> <NUM> INFO dfs.DataNode$DataXceiver: Received block <BLK> src: /<IP> dest: /<IP> of size <NUM>",
  "3141": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x111e0880, mask 0x04",
  "1981": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x00f254e0, mask 0x20",
  "1960": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x00dbd200, mask 0x80",
  "3809": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b858ca0, mask 0x40",
  "1736": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver x+ input pipe error(s) (dcr 0x02ec) detected and corrected over <NUM> seconds",
  "2234": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x03cfd1a0, mask 0x01",
  "2174": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0371a2a0, mask 0x10",
  "3198": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x12127ee0, mask 0x10",
  "3242": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x127ba460, mask 0x02",
  "3171": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x11b9cc60, mask 0x04",
  "3310": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x13698120, mask 0x04",
  "1940": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x009c14e0, mask 0x20",
  "1340": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading .<PATH>: invalid or missing program image, Permission denied",
  "5403": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ddr: activating redundant bit steering for next allocation: rank=<NUM> symbol=<NUM>",
  "5372": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x02): warning for torus x+ wire",
  "3011": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0d94da40, mask 0x02",
  "1339": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading .<PATH>: invalid or missing program image, No such file or directory",
  "1740": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver y+ input pipe error(s) (dcr 0x02ee) detected and corrected over <NUM> seconds",
  "2005": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0149b9c0, mask 0x10",
  "3403": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1573bc60, mask 0x80",
  "5311": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001b5",
  "5335": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x0000044d",
  "3999": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1efc7020, mask 0x20",
  "3590": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x18d431c0, mask 0x10",
  "2029": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x01d7a160, mask 0x10",
  "3816": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b859080, mask 0x40",
  "3795": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b8584e0, mask 0x80",
  "3169": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x11b3f3c0, mask 0x10",
  "3369": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1439cce0, mask 0x40",
  "2133": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x03231ca0, mask 0x10",
  "2475": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x06a7bd60, mask 0x40",
  "5383": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x0b): warning for torus z- wire, suppressing further interrupts of same type",
  "2514": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x06ec7a20, mask 0x20",
  "5318": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001f7",
  "4008": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1f8ffe60, mask 0x10",
  "2275": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x046461e0, mask 0x10",
  "3550": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x18a166c0, mask 0x02",
  "2040": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0210f640, mask 0x80",
  "2993": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0cf5dda0, mask 0x04",
  "3292": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1317cee0, mask 0x10",
  "6732": "KERNMNT <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL Error: unable to mount filesystem",
  "6708": "APPBUSY <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error creating node map from file <PATH>: Device or resource busy",
  "2307": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x04c2bb60, mask 0x20",
  "5309": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001b3",
  "5308": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001b2",
  "2284": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x047cc0c0, mask 0x08",
  "3267": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x12af93a0, mask 0x08",
  "2268": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0456cd40, mask 0x04",
  "1686": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL rts: bad message header: cpu <NUM> invalid (softheader=<HEX> <HEX> <HEX> <HEX>) PSR0=<HEX> PSR1=<HEX> PRXF=<HEX> PIXF=<HEX>",
  "3035": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0ea34280, mask 0x01",
  "3027": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0e37bbe0, mask 0x40",
  "2327": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x04fdc8e0, mask 0x01",
  "1364": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL",
  "2291": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x04903380, mask 0x20",
  "5314": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001f0",
  "4009": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1f9d7fe0, mask 0x10",
  "3208": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1222c460, mask 0x04",
  "3275": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x12d5a140, mask 0x80",
  "2348": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0589f8e0, mask 0x10",
  "8": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J04, ecid <HEX>",
  "3823": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b859480, mask 0x80",
  "3723": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b6eedc0, mask 0x02",
  "3177": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x11dafca0, mask 0x80",
  "1372": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL CHECK_INITIAL_GLOBAL_INTERRUPT_VALUES",
  "1433": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL data write plb error..............<NUM>",
  "1359": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: LOGIN chdir(<PATH>) failed: Permission denied",
  "5358": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: for node <NUM>, read continuation request but ioState is <NUM>",
  "2900": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0b85ea80, mask 0x08",
  "5386": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x0f): warning for tree A1 wire",
  "2287": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0483fae0, mask 0x40",
  "3333": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x139fc420, mask 0x04",
  "2240": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x03efaea0, mask 0x40",
  "3304": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x13487240, mask 0x04",
  "2359": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x05c9d940, mask 0x02",
  "3600": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x18e33e80, mask 0x04",
  "2776": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0a2ae600, mask 0x10",
  "2369": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x05eed3a0, mask 0x01",
  "2543": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0795ad60, mask 0x80",
  "2548": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x07c3f5e0, mask 0x04",
  "3166": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x11af9bc0, mask 0x40",
  "2727": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x09e42d40, mask 0x02",
  "1726": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> L3 directory error(s) (dcr 0x0152) detected and corrected",
  "1738": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver x- input pipe error(s) (dcr 0x02ed) detected and corrected over <NUM> seconds",
  "1765": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> tree receiver <NUM> in re-synch state event(s) (dcr 0x01bc) detected over <NUM> seconds",
  "2256": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x041cc780, mask 0x80",
  "3483": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x171f9ac0, mask 0x02",
  "2713": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x09cecfc0, mask 0x40",
  "5364": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: generated <NUM> core files for program IMB-MPI1.1MB_perf",
  "5321": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Received signal <NUM>, code=<NUM>, errno=<NUM>, address=0x000001fb",
  "2355": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x05ace2c0, mask 0x20",
  "3156": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x117ed620, mask 0x10",
  "3482": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x171b7560, mask 0x20",
  "1816": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x00130980, mask 0x40",
  "2458": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x06909580, mask 0x20",
  "2354": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x05aae460, mask 0x20",
  "3800": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b8586c0, mask 0xc0",
  "2356": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x05ae8720, mask 0x02",
  "3188": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x12011320, mask 0x80",
  "5400": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ddr: Suppressing further CE interrupts",
  "2340": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x053c2ce0, mask 0x10",
  "3087": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x106f1ee0, mask 0x08",
  "1742": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver y- input pipe error(s) (dcr 0x02ef) detected and corrected over <NUM> seconds",
  "3941": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1c9036c0, mask 0x40",
  "3445": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x16789880, mask 0x04",
  "2023": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x019ae900, mask 0x10",
  "3426": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x161059a0, mask 0x40",
  "2318": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x04e03f00, mask 0x01",
  "2283": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x047bc1c0, mask 0x20",
  "2493": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x06c27c60, mask 0x40",
  "3238": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x127496e0, mask 0x40",
  "2947": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0bf434a0, mask 0x10",
  "2980": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0cbca9e0, mask 0x01",
  "3365": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x141cd3a0, mask 0x20",
  "5356": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: duplicate canonical-rank <NUM> to logical-rank <NUM> mapping at line <NUM> of node map file <PATH>",
  "1351": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS APP FATAL ciod: Error loading <PATH>?<PATH>: invalid or missing program image, No such file or directory",
  "3688": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1aad0bc0, mask 0x01",
  "2031": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x01d7f500, mask 0x01",
  "1976": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x00e462c0, mask 0x02",
  "2113": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x02ecac40, mask 0x04",
  "2378": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x06018e00, mask 0x08",
  "5378": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x07): warning for torus y- wire",
  "4012": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1fca2980, mask 0x40",
  "3032": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0e867940, mask 0x40",
  "5365": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: generated <NUM> core files for program IMB-MPI1.256B_perf",
  "2579": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0863fd00, mask 0x40",
  "2829": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0b32cd60, mask 0x08",
  "3363": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x14123c20, mask 0x08",
  "14": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J10, ecid <HEX>",
  "3417": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x15b83f00, mask 0x10",
  "3021": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0e0272e0, mask 0x10",
  "1545": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL imprecise machine check...........<NUM>",
  "10": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J06, ecid <HEX>",
  "2787": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0a508740, mask 0x02",
  "2674": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x094df2a0, mask 0x40",
  "4120": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO Kernel detected <HEX> integer alignment exceptions (<HEX>) iar 0x00265598, dear 0x1feaa280 (<HEX>) iar 0x00265564, dear 0x1feaa1c0 (<HEX>) iar 0x00265574, dear 0x1feaa1e0 (<HEX>) iar 0x00265578, dear 0x1feaa200 (<HEX>) iar 0x00265588, dear 0x1feaa220 (<HEX>) iar 0x0026558c, dear 0x1feaa240 (<HEX>) iar 0x00265594, dear 0x1feaa260 (<HEX>) iar 0x00265598, dear 0x1feaa280",
  "2233": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x03cf9420, mask 0x04",
  "3399": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x155e28e0, mask 0x08",
  "2245": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x03ffa060, mask 0x04",
  "18": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J14, ecid <HEX>",
  "5": "- <HEX> <DATE> - <TS> RAS KERNEL FATAL Kill job <NUM> timed out. Block freed.",
  "3807": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b858c80, mask 0x80",
  "12": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J08, ecid <HEX>",
  "3953": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1d125620, mask 0x20",
  "3311": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x136cd5e0, mask 0x04",
  "5366": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: generated <NUM> core files for program IMB-MPI1.2KB_perf",
  "3634": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1931cdc0, mask 0x80",
  "2219": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x03b3e980, mask 0x02",
  "3287": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x130250e0, mask 0x01",
  "2680": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x095e86e0, mask 0x01",
  "3139": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x111d8c60, mask 0x01",
  "3155": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1175ff60, mask 0x08",
  "1311": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL MONITOR FAILURE Link PGOOD error latched on link card",
  "3160": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x118abf60, mask 0x08",
  "13": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J09, ecid <HEX>",
  "19": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J15, ecid <HEX>",
  "5377": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO critical input interrupt (unit=0x0b bit=0x06): warning for torus y+ wire, suppressing further interrupts of same type",
  "5348": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO ciod: Unexpected eof at line <NUM> of node map file <PATH>",
  "3164": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1196ed60, mask 0x80",
  "1420": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL d-cache flush parity error........<NUM>",
  "3996": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1ee84040, mask 0x01",
  "2375": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x05fbb6e0, mask 0x80",
  "3239": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x127516e0, mask 0x40",
  "3437": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x163f80e0, mask 0x80",
  "3610": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x18eb0d60, mask 0x02",
  "2173": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x037175c0, mask 0x08",
  "2302": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x04ba6240, mask 0x10",
  "3368": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1438f9e0, mask 0x40",
  "3682": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1a5e2fe0, mask 0x04",
  "3519": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1808d120, mask 0x80",
  "21": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J17, ecid <HEX>",
  "3928": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1c356380, mask 0x08",
  "2531": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0718de60, mask 0x01",
  "1744": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus receiver z+ input pipe error(s) (dcr 0x02f0) detected and corrected over <NUM> seconds",
  "3428": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x161850e0, mask 0x01",
  "3652": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x19b019a0, mask 0x02",
  "2127": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x03189100, mask 0x10",
  "1460": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL external input interrupt (unit=0x02 bit=0x0c): torus sender y- retransmission error was corrected",
  "3107": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x10a45ae0, mask 0x08",
  "3731": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1b70b860, mask 0x80",
  "17": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J13, ecid <HEX>",
  "1461": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL FATAL external input interrupt (unit=0x02 bit=0x0d): torus sender z+ retransmission error was corrected",
  "3926": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x1c308d20, mask 0x80",
  "3129": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x110067e0, mask 0x02",
  "2555": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x0808c940, mask 0x40",
  "1713": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <HEX> L3 EDRAM error(s) (dcr 0x0157) detected and corrected",
  "3176": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x11dab4c0, mask 0x04",
  "1748": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO <NUM> torus sender x+ retransmission error(s) (dcr 0x02f4) detected and corrected",
  "20": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J16, ecid <HEX>",
  "11": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL DISCOVERY ERROR Found invalid node ecid in processor card slot J07, ecid <HEX>",
  "3538": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x187a8be0, mask 0x08",
  "3631": "- <HEX> <DATE> <NODE> <TS> <NODE> RAS KERNEL INFO CE sym <NUM>, at 0x19165940, mask 0x40",
  "1111": "- <HEX> <DATE> <NODE> <TS> <NODE> NULL HARDWARE SEVERE LinkCard power module U58 is not accessible",
